Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: Es va traduir a l'anglés un conjunt de 49 frases en rus usant un diccionari de només 250 mots i 6 regles gramaticals; aquestes llengües van ser les elegides per raons geopolítiques per als primers sistemes de TA.
es_es: Se tradujo al inglés un conjunto de 49 frases en ruso usando un diccionario de nada más que 250 palabras y 6 reglas gramaticales; estas lenguas fueron elegidas por razones geopolíticas para los primeros sistemas de TA.

source: Es vol construir un sistema de traducció automàtica que traduïsca entre qualssevol dues llengües del grup format pel portugués, el gallec, el català, l'espanyol i l'italià.
es_es: Se quiere construir un sistema de traducción automática que traduzca entre cualquiera de las dos lenguas del grupo formado por el portugués, el gallego, el catalán, el español y el italiano.

source: Eurotra és un dels projectes de traducció més coneguts del decenni dels 80.
es_es: Eurotra es uno de los proyectos de traducción más conocidos de la década de los 80.

source: Evidentment, no sempre s'han de moure els adjectius; la traducció correcta de the last car és l'últim cotxe, sense canviar l'ordre.
es_es: Evidentemente, no siempre se tienen que mover los adjetivos; la traducción correcta de the last car es el último coche, sin cambiar el orden.

source: Finalment, la fase de generació transforma aquesta representació en la frase en LM.
es_es: Finalmente, la fase de generación transforma esta representación en la frase en LM.

source: Fins i tot hi ha empreses com ara KantanMT ({http://kantanmt.com}) que construeixen sistemes a mida per als seus clients usant simplement un navegador.
es_es: Incluso hay empresas como KantanMT ({http://kantanmt.com}) que construyen sistemas a medida para sus clientes usando simplemente un navegador.

source: Fins i tot, podria ser similar a una llengua humana.
es_es: Incluso, podría ser similar a una lengua humana.

source: Fixeu-vos en aquests dos exemples, on s'ha fet una anàlisi sintàctica parcial per a marcar els sintagmes nominals amb claudàtors: $${ll}
es_es: Fijaos en estos dos ejemplos, donde se ha hecho un análisis sintáctico parcial para marcar los sintagmas nominales con corchetes: $${ll}

source: Fixeu-vos en els exemples i digueu quins són els patrons que detecta i quines les regles de reordenament associades.
es_es: Fijaos en los ejemplos y decid cuáles son los patrones que detecta y cuáles las reglas de reordenamiento asociadas.

source: Fixeu-vos en l'imperatiu espanyol demos: si va seguit del pronom enclític le, forma amb aquest un únic mot i rep un nou accent ortogràfic: démosle; si el pronom és nos, a més es perd una consonant: démonos; amb dos pronoms, pot ser { démonoslos}, etc.
es_es: Fijaos en el imperativo del español demos: si va seguido del pronombre enclítico le, forma con éste una única palabra y recibe un nuevo acento ortográfico démosle; si el pronombre es nos, además se pierde una consonante: démonos; con dos pronombres, puede ser { démonoslos}, etc.

source: Fixeu-vos en la taula de freqüències d'aparició d'alguns parells.
es_es: Fijaos en la tabla de frecuencias de aparición de algunos pares.

source: Fixeu-vos en les frases espanyoles següents i les traduccions al català fetes per un sistema que usa aquesta estratègia i deduïu quines són les seqüències que detecta i quines no.
es_es: Fijaos en las frases españolas siguientes y las traducciones al catalán hechas por un sistema que usa esta estrategia y deducid cuáles son las secuencias que detecta y cuáles no.

source: Fixeu-vos que la traducció automàtica basada en exemples pot necessitar que la mostra de frases i traduccions estiga, a més, anotada lingüísticament (en l'exemple, indicant quins mots o estructures funcionen com un nom).
es_es: Fijaos en que la traducción automática basada en ejemplos puede necesitar que la muestra de frases y traducciones esté, además, anotada lingüísticamente (en el ejemplo, indicando qué palabras o estructuras funcionan como un nombre).

source: Fran consulta a través d'Internet la base de dades terminològica IATE (vegeu l'apartat ) quan tradueix dossiers antiglobalització de l'anglés al neerlandés.
es_es: Fran consulta a través de Internet la base de datos terminológica IATE (véase el apartado ) cuando traduce dossieres antiglobalización del inglés al neerlandés.

source: Funcionament de la traducció automàtica
es_es: Funcionamiento de la traducción automática

source: G}} $$ {0.5cm}{es} Si ara volem escriure el sistema de traducció invers, espanyol--anglés, és a dir, {0.5cm}{es} $$ {{0.75cm}{dA\(_{es}\)
es_es: G}} $$ {0.5cm}{es} Si ahora queremos escribir el sistema de traducción inversa, español--inglés, es decir, {0.5cm}{es} $$ {{0.75cm}{dA\(_{es}\)

source: G}} $$ {0.5cm}{en} podríem traure avantatge del fet que hi ha grans semblances entre les dades lingüístiques de aquest sistema i les del sistema anterior: les dades que necessitem per a l'anàlisi de l'espanyol dA\(_{es}\) són molt similars a les dades de generació de l'espanyol dG\(_{es}\) del sistema existent: per a analitzar l'espanyol podem reciclar una bona part de les dades que s'usaven per a generar-lo en el sistema anterior; les dades que necessitem per a la generació de l'anglés dG\(_{en}\) són molt similars a les dades d'anàlisi de l'anglés dA\(_{en}\) del sistema existent: per a generar l'anglés podem reciclar una bona part de les dades que s'usaven per a analitzar-lo en el sistema anterior; les dades de transferència de l'espanyol a l'anglés dT\(_{es en}\) són molt similars a les dades de transferència de l'anglés a l'espanyol dT\(_{en es}\) del sistema existent: per a transferir d'espanyol a anglés podem usar una bona part de les dades que s'usaven per a transferir des de l'anglés a l'espanyol en el sistema anterior (per exemple, podem ``pegar la volta'' als diccionaris bilingües i podríem aprofitar-ne moltes entrades).
es_es: G}} $$ {0.5cm}{} podríamos sacar ventaja del hecho de que hay grandes parecidos entre los datos lingüísticos de este sistema y los del sistema anterior: los datos que necesitamos para el análisis del español dA\(_{es}\) son muy similares a los datos de generación del español dg\(_{es}\) del sistema existente: para analizar el español podemos reciclar una buena parte de los datos que se usaban para generarlo en el sistema anterior; los datos que necesitamos para la generación del inglés dg\(_{en}\) son muy similares a los datos de análisis del inglés dA\(_{en}\) del sistema existente: para generar el inglés podemos reciclar una buena parte de los datos que se usaban para analizarlo en el sistema anterior; los datos de transferencia del español al inglés dT\(_{es en}\) son muy similares a los datos de transferencia del inglés al español dT\(_{en es}\) del sistema existente: para transferir de español a inglés podemos usar una buena parte de los datos que se usaban para transferir desde el inglés al español en el sistema anterior (por ejemplo, podemos "pegar la vuelta'' a los diccionarios bilingües y podríamos aprovechar muchas entradas).

source: Han de ser les mínimes necessàries: si hi ha més d'una edició possible, cal elegir la que es faça amb el mínim de modificacions necessàries.
es_es: Tienen que ser las mínimas necesarias: si hay más de una edición posible, elegid la que se haga con el mínimo de modificaciones necesarias.

source: Hem de tenir en compte que la persona posteditora, a més de conéixer la llengua meta i ser capaç de convertir el text en brut a una forma genuïna en aquesta llengua (és a dir, a més de ser professional de la traducció), ha de ser una veritable especialista en postedició, que coneix el sistema de traducció automàtica i quins en són els errors més típics.
es_es: Tenemos que tener en cuenta que la persona posteditora, además de conocer la lengua meta y ser capaz de convertir el texto en bruto a una forma genuina en esta lengua (es decir, además de ser profesional de la traducción), tiene que ser una verdadera especialista en postedición, que conoce el sistema de traducción automática y cuáles son los errores más típicos.

source: Heu d'indicar tres tipus diferents de canvi.
es_es: Tenéis que indicar tres tipos diferentes de cambio.

source: Heus ací algunes frases espanyoles amb { cuyo}, les traduccions produïdes per CasCat, i, on la traducció és incorrecta, una alternativa acceptable.
es_es: He aquí algunas frases españolas con { cuyo}, las traducciones producidas por CasCat, y, donde la traducción es incorrecta, una alternativa aceptable.

source: Heus ací alguns exemples:
es_es: He aquí algunos ejemplos:

source: Hi ha dos grans grups de sistemes de traducció automàtica: D'una banda, els sistemes de traducció automàtica basats en regles (en anglés, rule-based machine translation) o basats en coneixement (en anglés knowledge-based machine translation).
es_es: Hay dos grandes grupos de sistemas de traducción automática: Por un lado, los sistemas de traducción automática basados en reglas (en inglés, rule-based machine translation) o basados en conocimiento (en inglés knowledge-based machine translation).

source: Ho fan aplicant transformacions a l'arbre d'anàlisi sintàctica (transferència estructural) i substituint els mots (transferència lèxica), sense construir una representació explícita de la interpretació; aquesta és l'aproximació de transferència.
es_es: Lo hacen aplicando transformaciones en el árbol de análisis sintáctico (transferencia estructural) y sustituyendo las palabras (transferencia léxica), sin construir una representación explícita de la interpretación; ésta es la aproximación de transferencia.

source: I hi ha a la vista
es_es: Y hay a la vista

source: Imaginem el sintagma nominal següent en anglés: The old professor's smart girlfriend's red car; el sintagma és massa llarg per a la major part dels programes de transferència morfològica, perquè involucra una seqüència massa llarga de reordenament.
es_es: Imaginemos el sintagma nominal siguiente en inglés: The old professor's smart girlfriend's red car; el sintagma es demasiado largo para la mayor parte de los programas de transferencia morfológica, ya que involucra una secuencia demasiado larga de reordenamiento.

source: Imaginem que seguim aquest mètode amb el mot angoixaven: Quan només hem vist ang- hi ha encara moltes possibilitats: pot ser, entre altres, qualsevol forma dels mots angina, angle, anglés, angoixa, angoixar, angost, { anguila} i angula.
es_es: Imaginad que seguimos este método con la palabra catalana angoixaven: Cuando vemos sólo ang- aún hay muchas posibilidades: puede ser, entre otras, cualquier forma de las palabras angina, angle, anglés, angoixa, angoixar, angost, { anguila} y angula.

source: Imaginem que volem traduir de l'anglés al català i hem decidit que s'han d'usar aquestes regles de reordenament: [$R_1$] (en) adj subst $$ (ca) subst adj [$R_2$] (en) subst$_1$ subst$_2$ $$ (ca) subst$_2$ prepde subst$_1$ Per exemple, la regla $R_1$ reordenaria ``tall driver'' en ``conductor alt'' i la regla $R_2$ reordenaria ``truck driver'' en ``conductor de camió''.
es_es: Imaginemos que queremos traducir del inglés al catalán y hemos decidido que se tienen que usar estas reglas de reordenamiento: [$R_1$] (en) adj sust $$ (ca) sust adj [$R_2$] (en) sust$_1$ sust$_2$ $$ (ca) sust$_2$ prepde sust sust$_1$ Por ejemplo, la regla $R_1$ reordenaría ``tall driver'' en ``conductor alto'' y la regla $R_2$ reordenaría ``truck driver'' en ``conductor de camión''.

source: Imaginem tres llengües que anomenarem $L_1$, $L_2$ i $L_3$.
es_es: Imaginemos tres lenguas que denominaremos $L_1$, $L_2$ i $L_3$.

source: Imagineu que podem elegir entre dos sistemes de traducció automàtica diferent $t_A$ i $t_B$ per a traduir manuals de televisors de l'anglés al francés, i que s'ha de dissenyar un anglés controlat per a minimitzar la postedició.
es_es: Imaginad que podemos elegir entre dos sistemas de traducción automática diferente $t_A$ y $t_B$ para traducir manuales de televisores del inglés al francés, y que se tiene que diseñar un inglés controlado para minimizar la postedición.

source: Imagineu que sou part d'un equip de desenvolupament d'un sistema de traducció automàtica del maori al català (o a l'espanyol) basat en l'estratègia que hem anomenat en l'apartat transferència morfològica avançada. Especifica completament dues regles (indicant possibles reordenaments i operacions per a assegurar la con­cordança) que permeten donar la traducció correcta de les oracions de dalt i de les següents.
es_es: Imaginad que sois parte de un equipo de desarrollo de un sistema de traducción automática del maorí al catalán (o al español) basado en la estrategia que hemos denominado en el apartado transferencia morfológica avanzada. Especifica completamente dos reglas (indicando posibles reordenamientos y operaciones para asegurar la concordancia) que permiten dar la traducción correcta de las oraciones de arriba y de las siguientes.

source: Imagineu que tenim un sistema de traducció automàtica que ens costa uns 0,03 euros per mot traduït i que produeix un 10% de mots incorrectes en les traduccions.
es_es: Imaginad que tenemos un sistema de traducción automática que nos cuesta unos 0,03 euros por palabra traducida y que produce un 10% de palabras incorrectas en las traducciones.

source: Imagineu que tenim un sistema de transferència morfològica avançada que tradueix d'interlingua al català (o a l'espanyol) usant aquestes quatre regles: [$R_1$] detecta det--n i escriu trad(det)--trad(n), fent concordar trad(det) en gènere i en nombre amb trad(n) [$R_2$] detecta det--n--adj i escriu trad(det)--trad(n)-trad(adj), fent concordar trad(det) i trad(adj)en gènere i en nombre amb trad(n) [$R_3$] detecta n--adj i escriu trad(n)--trad(adj), fent concordar trad(adj) en gènere i en nombre amb trad(n) [$R_4$] detecta adj--n i escriu trad(n)--trad(adj), fent concordar trad(adj) en gènere i en nombre amb trad(n) Si no es pot usar informació de concordança, la traducció dels determinants i els adjectius es fa en masculí singular.
es_es: Imaginad que tenemos un sistema de transferencia morfológica avanzada que traduce de interlingua al catalán (o al español) usando estas cuatro reglas: [$R_1$] detecta det--n y escribe trad(det)--trad(n), haciendo concordar trad(det) en género y en número con trad(n) [$R_2$] detecta det--n--adj y escribe trad(det)--trad(n)-trad(adj), haciendo concordar trad(det) y trad(adj)en género y en número con trad(n) [$R_3$] detecta n--adj y escribe trad(n)--trad(adj), haciendo concordar trad(adj) en género y en número con trad(n) [$R_4$] detecta adj--n y escribe trad(n)--trad(adj), haciendo concordar trad(adj) en género y en número con trad(n) Si no se puede usar información de concordancia, la traducción de los determinantes y los adjetivos se hace en masculino singular.

source: Imagineu que un traductor professional cobra 0,05 euros per mot de text traduït i que un corrector de textos cobra 0,10 euros per mot de text corregit.
es_es: Imaginad que un traductor profesional cobra 0,05 euros por palabra de texto traducido y que un corrector de textos cobra 0,10 euros por palabra de texto corregido.

source: Indica en quina d'aquestes situacions de traducció automàtica són menys crucials la gramaticalitat o naturalitat lingüística de la traducció.
es_es: Indica en cuál de estas situaciones de traducción automática son menos cruciales la gramaticalidad o naturalidad lingüística de la traducción.

source: Indica quina d'aquestes situacions de traducció automàtica és d'assimilació d'informació: Narcís usa el programa traductor de l'anglés a l'espanyol Spanish Assistant per a llegir els documents electrònics que troba en Internet sobre la influència de l'èuscar sobre el gascó.
es_es: Indica cuál de estas situaciones de traducción automática es de asimilación de información: Narciso usa el programa traductor del inglés al español Spanish Assistant para leer los documentos electrónicos que encuentra en Internet sobre la influencia del euskera sobre el gascón.

source: Indica quines traduccions al català (o a l'espanyol) produirà aquest sistema per a les frases següents i per què: Un longe viage Un longe viages Un viages longe Longe viages Un governamento non democratic Un governamentos non democratic Tu melior ideales Un bon solution
es_es: Indica qué traducciones al catalán (o al español) producirá este sistema para las frases siguientes y por qué: Un longe viage Un longe viages Un viages longe Longe viages Un governamento non democratic Un governamentos non democratic Tu melior ideales Un bon solution

source: Indiqueu en quin (o quins) tipus de sistema de traducció automàtica trobem un disseny que aplica, exactament o aproximadament, el principi de composicionalitat.
es_es: Indicad en qué tipo (o tipos) de sistema de traducción automática encontramos un diseño que aplica, exactamente o aproximadamente, el principio de composicionalidad.

source: Indiqueu quina d'aquestes afirmacions és falsa.
es_es: Indica cuál de estas afirmaciones es falsa.

source: Indiqueu quina de les afirmacions següents és certa.
es_es: Indicad cuál de las afirmaciones siguientes es cierta.

source: Indiqueu quines serien les 3 regles que proposaríeu, tenint en compte que han de produir, com a mínim, tres oracions ben traduïdes en el corpus d'oracions següents (la traducció ideal s'indica entre parèntesis, tot i que no sempre podrà ser aconseguida): A dark autumn night (Una nit fosca de tardor) A high tide (Una marea alta) A magic dark silhouette (Una silueta fosca màgica) An autumn tide (Una marea de tardor) A dark magic silhouette (Una silueta màgica fosca) A dark autumn high tide (Una marea alta de tardor fosca) A dark night (Una nit fosca)
es_es: Indicad cuáles serían las 3 reglas que propondríais, teniendo en cuenta que tienen que producir, como mínimo, tres oraciones bien traducidas en el corpus de oraciones siguientes (la traducción ideal se indica entre paréntesis, a pesar de que no siempre se podrá conseguir): A dark autumn night (Una nit fosca de tardor) A high tide (Una marea alta) A magic dark silhouette (Una silueta fosca màgica) An autumn tide (Una marea de tardor) A dark magic silhouette (Una silueta màgica fosca) A dark autumn high tide (Una marea alta de tardor fosca) A dark night (Una nit fosca)

source: Interlingua, a més de ser el nom de la representació intermèdia dels sistemes indirectes sense transferència, és el d'una llengua artificial bàsicament d'arrel llatina, amb una flexió simplificada, i amb un vocabulari dissenyat per a ser comprensible a molts europeus.
es_es: Interlingua, además de ser el nombre de la representación intermedia de los sistemas indirectos sin transferencia, es el de una lengua artificial básicamente de raíz latina, con una flexión simplificada, y con un vocabulario diseñado para ser comprensible a muchos europeos.

source: Ja podem dir que el lema comença per { ango}.
es_es: Ya podemos decir que el lema comienza por { ango}.

source: Justifiqueu la resposta.
es_es: Justificad la respuesta.

source: Justifiqueu la vostra resposta.
es_es: Justificad vuestra respuesta.

source: L'anàlisi morfològica és el procés que determina, per a cada mot d'un text (forma superficial o flexionada) una o diverses formes lèxiques, consistents en una forma canònica o lema i informació sobre la categoria lèxica del mot i la flexió (vegeu la secció ).
es_es: El análisis morfológico es el proceso que determina, para cada palabra de un texto (forma superficial o flexionada) una o diversas formas léxicas, consistentes en una forma canónica o lema e información sobre la categoría léxica de la palabra y la flexión (véase la sección ).

source: L'acció pertinent és
es_es: La acción pertinente es

source: L'adopció d'un llenguatge controlat en una situació de traducció de documents d'una llengua a moltes llengües per a la disseminació és, en el procés complet, una alternativa a{} {}la postedició repetitiva dels documents meta.
es_es: La adopción de un lenguaje controlado en una situación de traducción de documentos de una lengua a muchas lenguas para la diseminación es, en el proceso completo, una alternativa a{} {}la postedición repetitiva de los documentos meta.

source: L'analitzador ens pot dir ja angoixar<verb><imp>.
es_es: El analizador ya puede decirnos angoixar<verb><imp>.

source: L'analitzador llig la forma superficial lletra per lletra, va d'estat en estat, i va produint la forma lèxica, fins que llig tot el mot; si arriba a un estat final, accepta el mot i en retorna la forma lèxica.
es_es: El analizador lee la forma superficial letra por letra, va de estado en estado, y va produciendo la forma léxica, hasta que lee toda la palabra; si llega a un estado final, acepta la palabra y devuelve la forma léxica.

source: L'analitzador produeix: angoixar<verb><imp><3p><pl>.
es_es: El analizador produce: angoixar<verb><imp><3p><pl>.

source: L'analitzador sintàctic actua després de l'analitzador morfològic, i obté l'arbre d'anàlisi sintàctica (o els arbres, si n'hi ha més d'un) a partir de la seqüència de categories lèxiques de la frase; cada arbre indica una possible combinació i ordre d'aplicació de regles que dóna lloc a la frase en qüestió.
es_es: El analizador sintáctico actúa después del analizador morfológico y obtiene el árbol de análisis sintáctico (o los árboles, si hay más de uno) a partir de la secuencia de categorías léxicas de la frase; cada árbol indica una posible combinación y orden de aplicación de reglas que da lugar a la frase en cuestión.

source: L'anàlisi del text origen és tan profunda en els sistemes d'interlingua clàssics que no és necessària la transferència.}
es_es: El análisis del texto origen es tan profundo en los sistemas de interlingua clásicos que no es necesaria la transferencia.}

source: L'anàlisi morfològica pren una oració i... ... produeix un arbre d'anàlisi.
es_es: El análisis morfológico toma una oración y... ... produce un árbol de análisis.

source: L'anàlisi sintàctica s'explica amb més detall en l'apartat .
es_es: El análisis sintáctico se explica con más detalle en el apartado .

source: L'arquitectura de transferència té tres característiques interessants que mereixen ser esmentades: [Funcionament com a cadena de muntatge.] El sistema de transferència funciona com una cadena de muntatge: com que els tres mòduls treballen d'esquerra a dreta i en una única passada, no cal que un mòdul espere que l'anterior acabe amb el text: poden treballar paral·lelament; això fa que els sistemes d'aquesta naturalesa siguen molt ràpids. [Modularitat.] La divisió en mòduls o etapes ben diferenciades (anàlisi, transferència i generació) en permet la reutilització.
es_es: La arquitectura de transferencia tiene tres características interesantes que merecen ser mencionadas: [Funcionamiento como cadena de montaje.] El sistema de transferencia funciona como una cadena de montaje: como los tres módulos trabajan de izquierda a derecha y en una única pasada, no hace falta que un módulo espere a que el anterior acabe con el texto: pueden trabajar paralelamente; esto hace que los sistemas de esta naturaleza sean muy rápidos. [Modularidad.] La división en módulos o etapas muy diferenciadas (análisis, transferencia y generación) permite la reutilización.

source: L'arquitectura de transferència és el model estàndard per a la traducció automàtica basada en regles o coneixement contemporània, i ho ha estat per molts anys {arnold93j}.
es_es: La arquitectura de transferencia es el modelo estándar para la traducción automática basada en reglas o conocimiento contemporáneo, y lo ha sido por muchos años {arnold93j}.
